import Event from '../assets/Templeimages/Event.jpeg'
import templevigrahas from '../assets/Templeimages/templevigrahas.jpeg'

function Events(){
    return(
        <div style={{backgroundColor:"whitesmoke",overflow:"auto",textOverflow:"hidden",fontSize:"11px",width:"80%"}}>
            <h1> శ్రీ సీతా లక్ష్మణ హనుమత్సమేత కోదండరామ స్వామి కి అంకితం చేయబడిన త్రయాహ్నిక బ్రహ్మోత్సవాల ఆహ్వాన పత్రిక.</h1>
            <img style={{borderRadius:"2vh",height:"30vh",width:"35vw"}} src={Event} alt="Events" className='eventsimage'/>
           <h1>మొదటి రోజు: 19-05-2026 (ప్రారంభం)</h1>
           <h2>ఉదయం:</h2>
           <h3>విష్వక్సేన పూజ మరియు పుణ్యాహవచనం</h3> <p>
<u>కారణం:</u>విష్వక్సేనుడు భగవంతుని సేనాధిపతి. బ్రహ్మోత్సవాలకు ఎలాంటి ఆటంకాలు రాకుండా ఉండటానికి ముందుగా విష్వక్సేన పూజ (విఘ్న నివారణ పూజ) చేస్తారు. పుణ్యాహవచనం ద్వారా మంత్రోచ్ఛారణలతో పవిత్ర జలాన్ని చల్లి, ఆలయ ప్రాంగణాన్ని మరియు పూజా ద్రవ్యాలను శుద్ధి చేస్తారు.</p>
        <h2>ఉదయం:</h2>
           <h3>అభిషేకం, అగ్నిప్రతిష్ఠ మరియు హోమం</h3><p>
<u>కారణం:</u> మూలవిరాట్టుకు చేసే అభిషేకం దైవిక శక్తిని పునరుజ్జీవింపజేస్తుంది. అగ్నిప్రతిష్ఠ ద్వారా పవిత్ర అగ్నిదేవుడిని ఆహ్వానిస్తారు. హోమంలో సమర్పించే హవిస్సులను (నైవేద్యాలను) అగ్నిదేవుడు నేరుగా దేవతలకు చేరవేస్తాడు.</p>
       <h2>సాయంత్రం: </h2>
      <h3>హనుమంత సేవ మరియు గ్రామోత్సవం </h3> <p>
       
<u> <h4>కారణం:</h4></u>తన పరమ భక్తుడైన హనుమంతుని వాహనంపై స్వామివారు ఊరేగుతారు. ఇది వినయాన్ని, అనన్య భక్తిని చాటిచెబుతుంది. వృద్ధులు, అనారోగ్యంతో ఉన్నవారు ఆలయానికి రాలేని వారి కోసం భగవంతుడే స్వయంగా వారి ఇంటి ముందుకు వచ్చి దర్శనమివ్వడమే గ్రామోత్సవం యొక్క ముఖ్య ఉద్దేశం.</p>



<h1>రెండవ రోజు: 20-05-2026 (భక్తి పరాకాష్ఠ)</h1>
           <h2>ఉదయం & సాయంత్రం:</h2>
        <h3>హోమ కార్యక్రమం మరియు పూజలు  </h3> <p>
<u><h4>కారణం:</h4></u>ఉత్సవ రోజుల్లో ఆలయ పరిసరాల్లో ఆధ్యాత్మిక ప్రకంపనలు (Vibrations) మరియు దైవిక శక్తి నిరంతరం కొనసాగడం కోసం నిరంతరాయంగా హోమాలు, జపాలు నిర్వహిస్తారు.
<h2>సాయంత్రం:</h2><h3> గరుడ సేవ గ్రామోత్సవం</h3><p></p>
<u><h4>కారణం:</h4></u> బ్రహ్మోత్సవాలన్నింటిలోకి గరుడ సేవ అత్యంత పవిత్రమైనది. మహావిష్ణువు (శ్రీరాముడు) కి గరుడుడు ప్రధాన వాహనం. గరుడ వాహనంపై ఉన్న స్వామివారిని దర్శించుకుంటే సమస్త పాపాలు తొలగిపోయి, మోక్షం సిద్ధిస్తుందని భక్తుల నమ్మకం.</p>


<h1>మూడవ రోజు: 21-05-2026 (మహా ముగింపు) </h1>
<h2>ఉదయం: </h2>
<h3> పూర్ణాహుతి</h3><p>
<u><h4>కారణం:</h4></u>మూడు రోజులుగా జరిగిన హోమాలకు సమర్పించే చివరి, అత్యున్నతమైన ఆహుతి ఇది. దీనితో యజ్ఞం/హోమం విజయవంతంగా పూర్తయినట్లు భావిస్తారు.</p>
<h2>సాయంత్రం: </h2>
<h3>స్వామివారి కళ్యాణం</h3><p>
<u><h4>కారణం:</h4></u>సీతారాముల దివ్య కళ్యాణ మహోత్సవం. ఈ వేడుకను వీక్షించడం వల్ల కుటుంబాలలో సంతోషం, దాంపత్య అనుకూలత, శాంతి లభిస్తాయి. ఇది జీవాత్మ, పరమాత్మల కలయికకు ప్రతీక.</p>
<h2>సాయంత్రం:</h2><h3> గజ వాహన సేవ గ్రామోత్సవం</h3><p>
<u><h4>కారణం:</h4></u> ఏనుగు (గజం) ఐశ్వర్యానికి, రాజసానికి మరియు బలానికి చిహ్నం. గజ వాహనంపై స్వామివారిని ఊరేగించడం ద్వారా గ్రామానికి అఖండ ఐశ్వర్యం, సంపద, మరియు అరిష్ట నివారణ జరుగుతుందని నమ్ముతారు.</p>
        </div>
    )
}
export default Events;